{
  "大吉": [
    {"poem":"山川明秀麗，桃李滿園香<br>佳期隨風至，福壽自長長","meaning":"環境美好，事業或學習成果豐碩，人際與情感皆順利，福運長久。"},
    {"poem":"花開映陽臺，車行滿寶街<br>執文朝帝殿，步馬聽雷聲","meaning":"像陽光照進房屋，花朵盛開般，願望順利實現。財寶如車般運到身邊，學問與品德被認可，地位逐漸提升，行動得心應手。"},
    {"poem":"深山多養道，忠正帝王宣<br>鳳翔鸞飛去，昇高過九天","meaning":"修行有成，忠心與德行受認同。鳳凰與鸞象徵吉祥與高升，努力付出後地位與成就皆可達到巔峰。"},
    {"poem":"春光滿庭院，流水帶清音<br>書卷隨風舞，佳人笑聲聞","meaning":"順利與喜悅隨日常而來，學問與情感皆有收穫，平凡中自帶好運。"},
    {"poem":"松柏挺高立，雲霧繞山巔<br>白鷺翔湖上，明月映清泉","meaning":"穩健如松柏，面對挑戰仍自信，努力成果顯現，生活平順安康。"},
    {"poem":"金鳳舞長空，玉樹映朝陽<br>書香盈室內，步步有吉祥","meaning":"光明與希望籠罩，學業與事業皆順利，步步進益，吉運連連。"},
    {"poem":"萬物生光彩，春風送暖意<br>喜鳥啼枝上，福到家門前","meaning":"福運降臨，喜事頻至，順心順意，生活如意安康。"},
    {"poem":"高山流水韻，雲海映晴天<br>晨光照書卷，桃李遍園田","meaning":"志向高遠，才華受賞識，努力成果明顯，學業與事業皆順利。"},
    {"poem":"晴空照花田，蜂舞香四溢<br>寶車入家門，福德日增益","meaning":"家庭與財運皆順，生活豐盛，願望得實現，平安喜樂。"},
    {"poem":"青山環繞居，溪水潺潺流<br>書聲隨風起，佳偶笑聲留","meaning":"安居樂業，文學或學習成果豐碩，情感與人際順利。"},
    {"poem":"晨曦映湖面，白鷺翔碧空<br>吉星照家宅，萬事皆順通","meaning":"家宅吉祥，生活順遂，運勢高漲，福運連綿。"},
    {"poem":"玉樹臨風立，金鶴舞長空<br>琴聲滿庭院，財福隨步生","meaning":"處世穩重，行動得心應手，財運與福氣皆到，順遂如意。"},
    {"poem":"陽光透窗照，綠竹搖清風<br>佳人笑語滿，喜事樂融融","meaning":"日常生活中充滿喜悅，順利完成心中所願，家庭與人際皆和樂。"},
    {"poem":"碧海映晴天，白帆點遠方<br>事業蒸蒸日，財福漸漸長","meaning":"前途光明，努力會被認可，財運穩定上升，事業順利。"},
    {"poem":"梅花凌雪傲，松柏挺寒風<br>書卷伴晨曦，福祿長久同","meaning":"逆境中保持堅定，努力學習與修養，運勢持久穩定，吉祥長久。"},
    {"poem":"錦鯉躍池上，春雨灑花田<br>福運隨心至，佳人笑聲傳","meaning":"順心如意，願望如春水般流暢，家運與情感皆佳。"},
    {"poem":"晨風拂柳岸，碧波映紅霞<br>書聲隨水起，日進喜氣加","meaning":"學業或事業進展順利，日常生活充滿喜悅，步步高升。"},
    {"poem":"山川明秀麗，桃李滿園香<br>佳期隨風至，福壽自長長","meaning":"環境美好，事業或學習成果豐碩，人際與情感皆順利，福運長久。"},
    {"poem":"金光映庭院，鳳鳥舞天空<br>書卷盈室中，喜樂隨步行","meaning":"學問與智慧得到肯定，家庭與生活充滿喜樂，順遂吉祥。"},
    {"poem":"竹影搖清風，溪水泛微波<br>佳人笑語中，福運自此多","meaning":"日常生活和諧安穩，吉運降臨，心願得實現，福氣長存。"}
  ],
  "吉": [
    {"poem":"春風送暖意，花影映窗前<br>學業有進展，人際多欣然","meaning":"順利但仍需努力，學習和人際關係皆有成長，宜保持耐心。"},
    {"poem":"綠柳搖春水，小鳥啼枝頭<br>事業有波折，調整方無憂","meaning":"生活與事業有些小波折，調整策略則可順利度過。"},
    {"poem":"日光灑庭院，書卷伴晨風<br>計畫有進行，小成逐漸見","meaning":"努力將有小收穫，但不宜過於急躁。"},
    {"poem":"山色映晴空，溪水潺潺行<br>心中有計策，步步得安穩","meaning":"思路清晰，行動穩健，雖有小困難，但可順利處理。"},
    {"poem":"花開映碧空，佳人笑語柔<br>事業稍波動，調整得平和","meaning":"小困難需調整心態，順勢而為，福運仍在。"},
    {"poem":"晨霧籠山巒，鳥鳴伴溪水<br>心中有方向，努力不徒然","meaning":"方向正確，努力會有回報，但需保持耐心。"},
    {"poem":"柳影搖清池，微風伴書聲<br>學習需刻苦，進步自然生","meaning":"學習或事業進展需持續努力，小成可見。"},
    {"poem":"白雲繞青山，花香透窗戶<br>計畫需小心，不急則安然","meaning":"宜謹慎行事，雖有波折但可順利解決。"},
    {"poem":"松柏迎晨光，溪水映碧空<br>心志漸穩健，行動不失中","meaning":"心態穩定，行事得法，雖有困難但可克服。"},
    {"poem":"碧水映晴天，鶴鳴伴微風<br>學業與事業，小有成果現","meaning":"努力可得小收穫，宜持續耐心耕耘。"}
  ],
  "末吉": [
    {"poem":"山影迷朦霧，花落帶寒風<br>行事稍不順，忍耐有所得","meaning":"目前事務進展緩慢，需耐心應對，收穫仍可期待。"},
    {"poem":"雨絲濕庭院，落葉亂隨風<br>努力未見果，謹慎免損失","meaning":"小心行事，努力尚未立刻有結果，避免急躁導致損失。"},
    {"poem":"青山隱雲霧，溪水略阻流<br>心緒多波折，慢步自安然","meaning":"心中有疑慮與不穩定，宜慢步行事，避免意氣用事。"},
    {"poem":"花影覆小徑，風拂帶寒意<br>計畫有阻礙，靜觀得安然","meaning":"計畫中可能遇小阻礙，宜冷靜觀察，耐心等待機會。"},
    {"poem":"夕陽染山巒，落葉隨水漂<br>努力無大損，福運漸漸到","meaning":"雖遇小困難，但努力不會徒勞，福運將逐漸降臨。"},
    {"poem":"夜雨潤庭院，寒蟬啼不休<br>心中事未成，謹慎得吉兆","meaning":"事情尚未完成，需保持謹慎，小心為上。"},
    {"poem":"薄霧籠小橋，水流曲曲彎<br>心中猶未定，漸行自安然","meaning":"心緒不穩，需循序漸進，行動會逐漸順利。"},
    {"poem":"落葉覆小徑，風冷寒意侵<br>行動宜緩慢，守正得平安","meaning":"遇阻時宜緩行，保守應對，能安然無恙。"},
    {"poem":"青松傲寒霜，溪水潺潺微<br>心緒須耐心，成果慢自來","meaning":"逆境中需耐心，穩步前行，成果會慢慢呈現。"},
    {"poem":"夕陽映小溪，白鷺點水面<br>事務緩行進，收穫自慢來","meaning":"事情進展慢，但仍會有成果，勿急躁。"}
  ],
  "凶": [
    {"poem":"雷雲覆高山，狂風掃林間<br>行事多阻礙，謹慎免損禍","meaning":"目前事情阻礙重重，需謹慎行事，避免意外或損失。"},
    {"poem":"落葉隨風去，溪水被雲覆<br>計畫多波折，勿貪冒進","meaning":"行動中有多重阻礙，不宜冒進，需慢慢調整策略。"},
    {"poem":"寒霧籠小徑，夜雨潤孤舟<br>心中多煩惱，慎行得安然","meaning":"情況不利，心中易焦躁，宜小心處理，穩步行動。"},
    {"poem":"山高雲遮頂，水深暗流湧<br>欲行難遂意，退守得平安","meaning":"事情難以順利，宜暫退守，避免損失。"},
    {"poem":"浮雲覆庭院，落葉滿地行<br>行事多阻礙，耐心自保身","meaning":"計畫受阻，需耐心小心，保護自身安全。"},
    {"poem":"風雨打窗戶，雷聲響夜空<br>心緒難安定，行動須謹慎","meaning":"外界干擾多，心情不穩，行事需小心。"},
    {"poem":"雲深迷山道，水急滔滔流<br>欲速則不達，慎行保安康","meaning":"急躁會受阻，宜謹慎行動，以免損失。"},
    {"poem":"寒風穿林過，落葉滿山坡<br>計畫多變故，守正方無虞","meaning":"計畫中可能遭遇突變，保持正道可避免災禍。"},
    {"poem":"雷雨侵庭院，驟風吹樹影<br>心緒多紛亂，行事須慎行","meaning":"情況混亂，需冷靜應對，避免意外。"},
    {"poem":"濁水覆小橋，黑雲壓山巒<br>行動不宜急，靜觀免災殃","meaning":"事情不穩定，宜靜觀，不可冒進，以免受損。"}
  ],
  "大凶": [
    {"poem":"暴雨傾庭院，狂風掃山林<br>行事皆不順，退守方保身","meaning":"運勢極低，行動會遇大阻礙，宜退守保護自身。"},
    {"poem":"雷電交天際，烏雲覆四方<br>計畫多變故，謹慎自保身","meaning":"計畫難成，環境不利，需保持謹慎與警覺。"},
    {"poem":"洪波襲小舟，狂風卷水面<br>行事危難多，暫守得平安","meaning":"處境險惡，冒進會有危險，宜暫時退守。"},
    {"poem":"夜黑覆庭院，寒霜滿小徑<br>心緒不安定，勿輕舉妄動","meaning":"環境不利，心情波動，切勿輕舉妄動。"},
    {"poem":"山崩水湧來，雷轟震九天<br>欲行皆阻礙，慎行保安全","meaning":"運勢極差，事情難以順利，謹慎行動才能保全。"},
    {"poem":"烏雲密天際，風雨亂庭院<br>計畫難貫徹，忍耐得小安","meaning":"計畫受阻，不宜急行，保持耐心方可稍安。"},
    {"poem":"大風破樹影，暴雨侵溪橋<br>行動皆不利，退守免災禍","meaning":"處境險惡，冒進會帶來災禍，宜退守為上策。"},
    {"poem":"雷雲壓山頂，驟雨打庭院<br>心中多阻礙，審慎得平安","meaning":"事情阻礙重重，需審慎行事，方能保全自身。"},
    {"poem":"暗夜覆小路，寒風掃落葉<br>行事不遂意，守正免禍害","meaning":"行動不順利，守正為安全之道。"},
    {"poem":"暴雨滂沱下，烏雲滿天空<br>欲行皆阻礙，退守保平安","meaning":"運勢極差，行動會遇大阻礙，宜退守保全。"}
  ]
}
